2412/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet/levelSet/R_05x_NB_01x/system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager steadyOptimisation;

primalSolvers
{
    op1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;
        solutionControls
        {
            nIters 300;
            residualControl
            {
                "p.*"       5.e-7;
                "U.*"       5.e-7;
            }
        }
    }
}

adjointManagers
{
    adjManager1
    {
        primalSolver             op1;
        adjointSolvers
        {
            as1
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;
                // manage objectives
                //------------------
                objectives
                {
                    type  incompressible;
                    objectiveNames
                    {
                        losses
                        {
                            weight          1.; 
                            type            PtLosses;
                            patches         (inlet "outlet.*");
                            normalise       true;
                        }
                    }
                }
                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel        standard;
                }
                // solution control
                //------------------
                solutionControls
                {
                    nIters 300;
                    residualControl
                    {
                        "pa.*"       5.e-7;
                        "Ua.*"       5.e-7;
                    }
                }
            }
            vol
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   null;
                isConstraint           true;
                // manage objectives
                //------------------
                objectives
                {
                    type  geometric;
                    objectiveNames
                    {
                        vol
                        {
                            weight         -1.; 
                            type            topOSolidVolume;
                          //percentage      0.462;
                            percentage
                            {
                                type scale;
                                scale
                                {
                                    type      stepRamp;
                                    start     0;
                                    duration  20;
                                    interval  5;
                                }
                                value
                                {
                                    type constant;
                                    value constant 0.538;
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}

optimisation
{
    designVariables
    {
        type levelSet;
        sensitivityType topO;
        fixedZeroPorousZones   (IEntranceSet OEntranceSet OREntranceSet);
        regularisation
        {
            regularise     true;
            meanRadiusMult 5;
            //radius 0.05;
        }
        interpolation
        {
            function    sigmoidalHeaviside;
            meanRadiusMult  1;
            //d           0.01;
        }
        initialisation
        { 
            method      meshWave;
        }
        betaMax    2500;
    }
    updateMethod
    {
        method MMA;
        eta 1;
    }
}

// ************************************************************************* //
